# SteelElemCopeDistanceAxis Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SteelElemCopeDistanceAxis Property
ParameterTypeId Class See Also
---
"Distance from axis"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SteelElemCopeDistanceAxis { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SteelElemCopeDistanceAxis As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SteelElemCopeDistanceAxis {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace